const actionLibrary = {



    // =====================
    // 爆发训练
    // =====================

    "爆发训练": {

        type:"repeat",

        description:
        "快速收紧2秒，放松2秒",

        tight:2,

        relax:2

    },





    // =====================
    // 初级耐力
    // =====================

    "初级耐力": {


        type:"repeat",


        description:
        "持续收紧10秒，放松5秒",


        tight:10,


        relax:5


    },






    // =====================
    // 中级耐力
    // =====================

    "中级耐力": {


        type:"repeat",


        description:
        "持续收紧10秒，放松5秒",


        tight:10,


        relax:5


    },







    // =====================
    // 高级耐力
    // =====================

    "高级耐力": {


        type:"repeat",


        description:
        "持续收紧20秒，放松10秒",


        tight:20,


        relax:10


    },







    // =====================
    // 超强耐力
    // =====================

    "超强耐力": {


        type:"repeat",


        description:
        "持续收紧30秒，放松10秒",


        tight:30,


        relax:10


    },







    // =====================
    // 三步收紧
    // =====================

    "三步收紧": {


        type:"repeat",


        description:
        "逐步增强收紧力度",



        tight:15,


        relax:10


    },







    // =====================
    // 五步收紧
    // =====================

    "五步收紧": {


        type:"repeat",


        description:
        "五阶段递进收紧",



        tight:25,


        relax:10


    }



};